Revit 2026 API

# DialogBoxShowingEventArgs Class

---

The base class for the event arguments used by the DialogBoxShowing event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPreEventArgs Autodesk.Revit.UI.EventsDialogBoxShowingEventArgs Autodesk.Revit.UI.EventsMessageBoxShowingEventArgs Autodesk.Revit.UI.EventsTaskDialogShowingEventArgs

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DialogBoxShowingEventArgs : RevitAPIPreEventArgs
```
```vb
Public Class DialogBoxShowingEventArgs
	Inherits RevitAPIPreEventArgs
```
```cpp
public ref class DialogBoxShowingEventArgs : public RevitAPIPreEventArgs
```
```fsharp
type DialogBoxShowingEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
```

The DialogBoxShowingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | DialogId | A unique string identifier for DialogBox and TaskDialog type dialogs in Revit. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from RevitAPIPreEventArgs) |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | OverrideResult | Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The actual type of the event arguments will be different depending upon the type of dialog shown. When the application receives this object, a dialog is to be displayed in Revit that requires user interaction. The OverrideResult function can be used to cause the dialog to be dismissed and return a desired result code.

#### Reference

Autodesk.Revit.UI.Events Namespace